// Цикл (Loop) — це механізм, який повторює виконання коду, поки умова істинна.
    // Програмування без циклів майже неможливе:
        // - перебір масивів
        // - підрахунки
        // - пошук
        // - генерація даних

// 1. FOR - Використовується, коли відома кількість ітерацій.
for (let a = 0; a < 5; a++) {
  console.log(a);
}
/* Як працює for?
        Створюється змінна
        Перевіряється умова
        Виконується код
        Виконується крок
        Знову перевірка умови*/

// 2. WHILE - Використовується, коли не знаємо точну кількість повторень.
let b = 0;

while (b < 5) {
  console.log(b);
  b++;
}
//      Infinite - Без зміни умови — нескінченний цикл.
        while (true) {
        console.log("Hello");
        }

// 3. DO...WHILE - Різниця: виконується мінімум один раз.
let c = 1;

do {
  console.log(c);
  c++;
} while (c < 5);



// break і continue
    // 1. break - Повністю зупиняє цикл.
for (let d = 0; d < 10; d++) {
  if (d === 5) break;
  console.log(d);
}

// 2. continue Пропускає поточну ітерацію.
for (let e = 0; e < 5; e++) {
  if (e === 2) continue;
  console.log(e);
}