/**
 * Level - Normal
 * Task - 1
 * Реалізуйте алгоритм, який обчислює степінь числа task1base в степені task1power використовуючи for, while, do..while оператори
 * Призначте результат відповідній змінній
 * ПРИМІТКА: не використовуйте Math.pow() або оператор **
 * Підказка: 2^3 = 2 * 2 * 2 = 8
 */
 
let task1ForPower = 1;
let task1WhilePower = 1;
let task1DoPower = 1;
 
const task1base = 2;
const task1power = 5; // 2^5 = 32
 
// Task - 1:1: алгоритм з "for"
// ваш код тут
 
// Task - 1:2: алгоритм з "while"
// ваш код тут
 
// Task - 1:3: алгоритм з "do"
// ваш код тут
 
/**
 * Level - Normal
 * Task - 2
 * Реалізуйте алгоритм, який створить рядок з кожного третього елемента масиву чисел
 * Збережіть результат у змінній task2Res
 * Підказка: ви можете використовувати цикли з числами для доступу до елементів масиву
 */
 
const task2Array = [10, 20, 30, 40, 50, 60, 70, 80, 90]; // => "306090"
let task2Res = '';
 
// ваш код тут
 
/**
 * Level - Normal
 * Task - 3
 * Реалізуйте алгоритм, який створить масив чисел у зворотному порядку з кроком 3
 * УВАГА!!! - елементи повинні братись з кінця до початку
 * Збережіть результат у змінній task3Res (це має бути масив)
 * ПРИМІТКА: не використовуйте метод array.reverse()
 */
 
const task3Array = [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]; // => [50, 35, 20, 5]
let task3Res = [];
 
// ваш код тут
 