// 0. Вступ
/*
      -JavaScript (JS) – це “безпечна” мова програмування. Вона не надає низькорівневого доступу до пам’яті чи процесора, оскільки була створена для браузерів, які цього не потребують.
      - Скрипт - це  програми написана мовою JS.
      - Рушій JavaScript — програмний рушій, спеціалізована програма, що виконує скрипти JavaScript, переважно, в браузерах[1], але також і у серверній реалізації. 

     Різні рушії мають різні “кодові назви”. Наприклад:
          V8 – в Chrome, Opera та Edge.
          SpiderMonkey – в Firefox.
         …Є також інші кодові назви як “Chakra” для IE, “JavaScriptCore”, “Nitro” і “SquirrelFish” для Safari, та інші.

      - Node.js — платформа з відкритим кодом для виконання високопродуктивних мережевих застосунків, написаних мовою JavaScript.
      - Політика того ж походження (англ. same origin policy) — важливе поняття в програмуванні скриптів на стороні клієнта (наприклад в мові JavaScript). Політика дозволяє скриптам, які працюють на сторінках, що згенеровані на одному сайті, отримати доступ до методів та атрибутів один одного без особливих обмежень, але забороняє доступ до більшості методів та властивостей на сторінках інших сайтів.

      = Специфікація ECMA-262 (https://ecma-international.org/publications-and-standards/standards/ecma-262/) містить найглибшу, найдетальнішу й найбільш формалізовану інформацію про JavaScript. Фактично, ця специфікація визначає мову.

      = MDN (Mozilla) JavaScript Reference (https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference) – це головний довідник з прикладами та іншою інформацією. Він чудово підходить для детального вивчення окремих функцій, методів тощо.
      - Інтегроване середовище розробки (ІСР, англ. integrated development environment або англ. IDE) — комплексне програмне рішення для розробки програмного забезпечення. Зазвичай, складається з редактора початкового коду, інструментів для автоматизації складання та відлагодження програм. Більшість сучасних середовищ розробки мають можливість автодоповнення коду.
      - “Легкі редактори” не такі потужні, як IDE, проте вони прості, доступні і швидко запускаються. Їх зазвичай використовують, щоб швидко відкрити і відредагувати один або декілька файлів.
*/

// 1. Основи JavaScript
/*
      - Тег “script” (<script>) - Дозволяє всталяти код JavaScript у будь-яку частину HTML документа.
           - Атрибут type: <script type=…> Старий стандарт HTML, HTML4, вимагав, щоб у <script> був атрибут type. Зазвичай це був type="text/javascript".
           - Атрибут language: <script language=…> Цей атрибут вказував на мову скрипту.
*/
           
/*
alert() — це вбудована функція JavaScript, яка показує модальне вікно з повідомленням і кнопкою OK.
*/
alert("Hello World")

/*
<script> - це тег, що дозволяє вставляти у HTML-код JavaScript.  
*/
<script src="alert.js"></script>

// 2. Змінні та Константи
/*
Змі́нна (англ. variable) — об'єкт програми, що має ім'я та значення.

var — це старе ключове слово для оголошення змінних, яке має функціональну або глобальну область видимості, дозволяє повторне оголошення та "підняття" (hoisting), але в сучасному коді його замінили більш передбачуваними let (блочна область видимості) та const (блочна, незмінна).
*/
var message = 'Привіт';

/*
let — це ключове слово для оголошення змінних з блоковою областю видимості, що означає, що змінна доступна лише в межах блоку коду (наприклад, {}) 
*/
let message = 'Hello';

/*
Іменування змінних

В JavaScript є два обмеження, які стосуються імен змінних:
1. Ім’я має містити лише букви, цифри або символи $ і _.
2. Перший символ не має бути числом.
Приклади допустимих імен:
*/
let userName;
let test123;

/*
const  — це ключове слово для оголошення змінних, значення яких не можна перепризначити після ініціалізації, що робить їх константами, які покращують надійність і читабельність коду
*/
const myBirthday = '01.08.1994';

/* 
Константи в верхньому регістрі
Широко поширена практика використання констант як псевдонімів для значень, які важко запам’ятати і які відомі до початку виконання скрипту.
Такі константи пишуться в верхньому регістрі з використанням підкреслень.
*/
const COLOR_RED = "#F00";
const COLOR_GREEN = "#0F0";
const COLOR_BLUE = "#00F";
const COLOR_ORANGE = "#FF7F00";

// 3. Типи даних
/*
У JavaScript є вісім основних типів даних.
      Число (number)
*/
let n = 123;
n = 12.345;
/*
Тип number представляє і цілі числа, і числа з рухомою точкою.
Є багато операцій, що можна робити з числами, наприклад, множення *, ділення /, додавання +, віднімання - тощо.
Окрім звичайних чисел, є так звані “спеціальні числові значення”, що також мають відношення до цього типу даних: Infinity, -Infinity і NaN.
            Infinity являє собою математичну нескінченність ∞. Це спеціальне значення, що є більшим за будь-яке число.
*/
alert(1 / 0); // Infinity
//або
alert(Infinity); // Infinity

/*
    NaN (Not a Number) являє собою помилку обчислення. Це є результат неправильної або невизначеної математичної операції, наприклад: 
*/
lert("not a number" / 2); // NaN, таке ділення є помилковим

/*
      BigInt
У JavaScript, тип “number” не може містити числа більші за (253-1) (це 9007199254740991), або менші за -(253-1) для від’ємних чисел.
*/
// буква "n" у кінці означає, що це число типу BigInt
const bigInt = 1234567890123456789012345678901234567890n;

/*
      Рядок (string) 
Рядок у JavaScript має бути оточений лапками.      
*/
let str = "Привіт";
let str2 = 'Одинарні лапки також дозволяються';
let phrase = `так можна вставляти ${str}`;
/*
У JavaScript є три типи лапок.
Подвійні лапки: "Привіт".
Одинарні лапки: 'Привіт'.
Зворотні лапки: `Привіт`.
Подвійні та одинарні лапки є “звичайними”. Тобто немає ніякої різниці, які саме використовувати.
Зворотні лапки є розширенням функціональності. Вони дають змогу вбудовувати змінні та вирази в рядок, обрамляючи їх в ${…} 

      Булевий або логічний тип (boolean)
Логічний тип може приймати лише два значення: true (істина) та false (хиба).
Цей тип зазвичай використовується для зберігання значень так/ні: true означає “так, вірно”, а false означає “ні, не вірно”.
*/
let nameFieldChecked = true; // так, ім’я було перевірене
let ageFieldChecked = false; // ні, вік не був перевіреним

/*
Значення “null”
Спеціальне значення null не належить до жодного з описаних вище типів.
Воно формує окремий власний тип, який містить лише значення null.
*/
let age = null;

/* 
Значення “undefined”
Спеціальне значення undefined також стоїть окремо. Воно представляє власний тип, подібний до “null”.
undefined означає, що “значення не присвоєно”.
*/
let age = 100;

// змінюємо значення на undefined
age = undefined;

alert(age); // "undefined"

/*
Об’єкти (object) та символи (symbol)
Тип object є особливим типом.
Усі інші типи називаються “примітивами”, тому що їхні значення можуть містити тільки один елемент (це може бути рядок, число, або будь-що інше). В об’єктах же зберігаються колекції даних і складніші структури.
Тип symbol використовується для створення унікальних ідентифікаторів в об’єктах. Ми згадали цей тип для повноти, проте докладніше вивчимо його після об’єктів.

Оператор typeof
Оператор typeof повертає тип аргументу. Це корисно, коли ми хочемо обробляти значення різних типів по-різному або просто хочемо зробити швидку перевірку.
Виклик typeof x повертає рядок із назвою типу:
*/
typeof undefined // "undefined"
typeof 0 // "number"
typeof 10n // "bigint"
typeof true // "boolean"
typeof "foo" // "string"
typeof Symbol("id") // "symbol"

typeof Math // "object"  (1)
typeof null // "object"  (2)
typeof alert // "function"  (3)
/* 
Останні три рядки можуть потребувати додаткового пояснення:
Math — це вбудований об’єкт, який забезпечує математичні операції. Ми вивчимо його в розділі Числа. Тут він використаний лише як приклад об’єкта.
Результатом typeof null є "object". Це офіційно визнана помилка поведінки typeof, що є ще з ранніх днів JavaScript і зберігається для сумісності. Безперечно, null не є об’єктом. Це особливе значення з власним типом. У цьому разі поведінка typeof некоректна.
Результатом typeof alert є "function", тому що alert — це функція. Ми будемо вивчати функції в наступних розділах, де ми також побачимо, що в JavaScript немає спеціального типу “function”. Функції належать до типу “об’єкт”. Але typeof трактує їх по-іншому, повертаючи "function". Це також присутнє з ранніх днів JavaScript. Технічно, така поведінка не зовсім правильна, але може бути зручною на практиці.


Взаємодія: alert, prompt, confirm
alert
Ми вже бачили цю функцію. Вона показує повідомлення та чекає, доки користувач не натисне кнопку “ОК”.
Наприклад:
*/
alert("Привіт");

/* 
Мінівікно з повідомленням називається модальним вікном. Слово “модальний” означає, що відвідувач не зможе взаємодіяти з іншою частиною сторінки, натискати інші кнопки тощо, доки не завершить операції з вікном. У цьому випадку – поки він не натисне “OK”.

prompt
Функція prompt приймає два аргументи:
*/

result = prompt(title, [default]);

/* 
Вона показує модальне вікно з текстовим повідомленням, полем, куди відвідувач може ввести текст, та кнопками ОК/Скасувати.

title
Текст, який буде відображатися для відвідувача.
default
Необов’язковий другий параметр, початкове значення для поля введення тексту.
*/
let age = prompt('Скільки вам років?', 100);
alert(`Вам ${age} років!`); // Вам 100 років!

/* Взаємодія: alert, prompt, confirm
*/
// alert - показує повідомлення та чекає, доки користувач не натисне кнопку “ОК”.
alert("Привіт");

//prompt - приймає два аргументи. Вона показує модальне вікно з текстовим повідомленням, полем, куди відвідувач може ввести текст, та кнопками ОК/Скасувати.
result = prompt(title, [default]);

let age = prompt('Скільки вам років?', 100);
alert(`Вам ${age} років!`); // Вам 100 років!

/*Функція confirm показує модальне вікно з питанням question та двома кнопками: ОК та Скасувати.
Результат: true, якщо натиснути кнопку OK, інакше — false.*/
result = confirm(question);

let isBoss = confirm("Ви бос?");
alert( isBoss ); // true, якщо натиснута OK



